RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_lpi2c.c
    /* Look up instance number */
    instance = LPI2C_GetInstance(base);

    /* Save base and instance. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Save this handle for IRQ use. */
    s_lpi2cMasterHandle[instance] = handle;

    /* Set irq handler. */
    s_lpi2cMasterIsr = LPI2C_MasterTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterIrqFlags);

    /* Enable NVIC IRQ, this only enables the IRQ directly connected to the NVIC.
     In some cases the LPI2C IRQ is configured through INTMUX, user needs to enable
     INTMUX IRQ in application code. */
    (void)EnableIRQ(kLpi2cIrqs[instance]);
}

static void LPI2C_TransferStateMachineSendCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);
    uint16_t sendval;

    /* Make sure there is room in the tx fifo for the next command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }

    /* Issue command. buf is a uint8_t* pointing at the uint16 command array. */
    sendval    = ((uint16_t)handle->buf[0]) | (((uint16_t)handle->buf[1]) << 8U);
    base->MTDR = sendval;
    handle->buf++;
    handle->buf++;

    /* Count down until all commands are sent. */
    if (--handle->remainingBytes == 0U)
    {
        /* Choose next state and set up buffer pointer and count. */
        if (0U != handle->transfer.dataSize)
        {
            /* Either a send or receive transfer is next. */
            handle->state          = (uint8_t)kTransferDataState;
            handle->buf            = (uint8_t *)handle->transfer.data;
            handle->remainingBytes = (uint16_t)handle->transfer.dataSize;
            if (handle->transfer.direction == kLPI2C_Read)
            {
                /* Disable TX interrupt */
                LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
                /* Issue command to receive data. A single write to MTDR can issue read operation of
                    0xFFU + 1 byte of data at most, so when the dataSize is larger than 0x100U, push
                    multiple read commands to MTDR until dataSize is reached. */
                size_t tmpRxSize = handle->transfer.dataSize;
                while (tmpRxSize != 0U)
                {
                    LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount);
                    /*
                     * $Branch Coverage Justification$
                     * The transmission commands will not exceed FIFO SIZE.(will improve)
                     */
                    while ((size_t)FSL_FEATURE_LPI2C_FIFO_SIZEn(base) == stateParams->txCount)
                    {
                        LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount);
                    }

                    if (tmpRxSize > 256U)
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(0xFFU);
                        tmpRxSize -= 256U;
                    }
                    else
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(tmpRxSize - 1U);
                        tmpRxSize  = 0U;
                    }
                }
            }
        }
        else
        {
            /* No transfer, so move to stop state. */
            handle->state = (uint8_t)kStopState;
        }
    }
}

static void LPI2C_TransferStateMachineReadCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);

    /* Make sure there is room in the tx fifo for the read command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }

    base->MTDR = (uint32_t)kRxDataCmd | LPI2C_MTDR_DATA(handle->transfer.dataSize - 1U);

    /* Move to transfer state. */
    handle->state = (uint8_t)kTransferDataState;
    if (handle->transfer.direction == kLPI2C_Read)
    {
        /* Disable TX interrupt */
        LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
    }
}

static void LPI2C_TransferStateMachineTransferData(LPI2C_Type *base,
                                                   lpi2c_master_handle_t *handle,
                                                   lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);

    if (handle->transfer.direction == kLPI2C_Write)
    {
        /* Make sure there is room in the tx fifo. */
        if (0U == stateParams->txCount--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Put byte to send in fifo. */
        base->MTDR = *(handle->buf)++;
    }
    else
    {
        /* XXX handle receive sizes > 256, use kIssueReadCommandState */
        /* Make sure there is data in the rx fifo. */
        if (0U == stateParams->rxCount--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Read byte from fifo. */
        *(handle->buf)++ = (uint8_t)(base->MRDR & LPI2C_MRDR_DATA_MASK);
    }

    /* Move to stop when the transfer is done. */
    if (--handle->remainingBytes == 0U)
    {
        if (handle->transfer.direction == kLPI2C_Write)
        {
            stateParams->state_complete = true;
        }
        handle->state = (uint8_t)kStopState;
    }
}

static void LPI2C_TransferStateMachineStopState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone)
{
    assert(stateParams != NULL);

    /* Only issue a stop transition if the caller requested it. */
    if ((handle->transfer.flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
    {
        /* Make sure there is room in the tx fifo for the stop command. */
        if (0U == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        base->MTDR = (uint32_t)kStopCmd;
    }
    else
    {
        /* If all data is read and no stop flag is required to send, we are done. */
        if (handle->transfer.direction == kLPI2C_Read)
        {
            *isDone = true;
        }
        stateParams->state_complete = true;
    }
    handle->state = (uint8_t)kWaitForCompletionState;
}

static void LPI2C_TransferStateMachineWaitState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone)
{
    assert(stateParams != NULL);

    if ((handle->transfer.flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
    {
        /* We stay in this state until the stop state is detected. */
        if (0U != ((stateParams->status) & (uint32_t)kLPI2C_MasterStopDetectFlag))
        {
            *isDone = true;
        }
    }
    else
    {
        /* If all data is pushed to FIFO and no stop flag is required to send, we need to make sure they
            are all send out to bus. */
        if ((handle->transfer.direction == kLPI2C_Write) && ((base->MFSR & LPI2C_MFSR_TXCOUNT_MASK) == 0U))
        {
            /* We stay in this state until the data is sent out to bus. */
            *isDone = true;
        }
    }
    stateParams->state_complete = true;
}

/*!
 * @brief Execute states until FIFOs are exhausted.
 * @param handle Master nonblocking driver handle.
 * @param[out] isDone Set to true if the transfer has completed.
 * @retval #kStatus_Success
 * @retval #kStatus_LPI2C_PinLowTimeout
 * @retval #kStatus_LPI2C_ArbitrationLost
 * @retval #kStatus_LPI2C_Nak
 * @retval #kStatus_LPI2C_FifoError
 */
static status_t LPI2C_RunTransferStateMachine(LPI2C_Type *base, lpi2c_master_handle_t *handle, bool *isDone)
{
    assert(NULL != base && NULL != handle && NULL != isDone);

    status_t result = kStatus_Success;
    lpi2c_state_machine_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

